# Summary table

```
----------------------------------------------------------------------------------------------------
CMD | SUPPORT | SYNTAX                 | DESCRIPTION
----------------------------------------------------------------------------------------------------
'S' |   YES   |   Sn[CR]               | Sets up with CAN FD nominal bit rate where n is 0-8.
    |         |                        | S0 10kbps          S3 100kbps         S6 500kbps
    |         |                        | S1 20kbps          S4 125kbps         S7 800kbps
    |         |                        | S2 50kbps          S5 250kbps         S8 1Mbps
's' |   YES+  |   sddxxyyzz[CR]        | Sets up CAN FD nominal bit rate and bit timing,
    |         |                        | where dd, xx, yy and zz are hex values.
'Y' |   YES+  |   Yn[CR]               | Sets up with CAN FD data bit rate where n is 0-2, 4, 5, 8.
    |         |                        | Y0 500kbps         Y3 3Mbps (N/A)     Y6 6Mbps (N/A)
    |         |                        | Y1 1Mbps           Y4 4Mbps           Y7 7Mbps (N/A)
    |         |                        | Y2 2Mbps           Y5 5Mbps           Y8 8Mbps
'y' |   YES+  |   yddxxyyzz[CR]        | Sets up CAN FD data bit rate and bit timing,
    |         |                        | where dd, xx, yy and zz are hex values.
'O' |   YES   |   O[CR]                | Opens the CAN FD channel in normal mode.
    |         |                        | Both sending & receiving are enabled.
'L' |   YES   |   L[CR]                | Opens the CAN FD channel in listen only mode.
    |         |                        | Only receiving is enabled.
'C' |   YES   |   C[CR]                | Closes the CAN FD channel.
'r' |   YES   |   riiil[CR]            | Transmits a base remote frame.
'R' |   YES   |   Riiiiiiiil[CR]       | Transmits an extended remote frame.
't' |   YES   |   tiiildd...[CR]       | Transmits a classical base data frame.
'T' |   YES   |   Tiiiiiiiildd...[CR]  | Transmits a classical extended data frame.
'd' |   YES+  |   diiildd...[CR]       | Transmits a FD base data frame without bit rate switch.
'D' |   YES+  |   Diiiiiiiildd...[CR]  | Transmits a FD extended data frame without bit rate switch.
'b' |   YES+  |   biiildd...[CR]       | Transmits a FD base data frame with bit rate switch.
'B' |   YES+  |   Biiiiiiiildd...[CR]  | Transmits a FD extended data frame with bit rate switch.
'P' |    -    |   P[CR]                | Polls incoming FIFO for CAN frames (single poll).
'A' |    -    |   A[CR]                | Polls incoming FIFO for CAN frames (all pending frames).
'F' |   YES   |   F[CR]                | Reads status flags.
'f' |   YES+  |   f[CR]                | Reads detailed status.
'X' |    -    |   Xn[CR]               | Sets Auto Poll/Send ON/OFF for received frames.
'W' |   YES   |   Wn[CR]               | Sets up filter mode setting.
    |         |                        | W0 Dual filter mode (N/A)
    |         |                        | W1 Single filter mode (N/A)
    |    +    |                        | W2 Simple filter mode
'M' |   YES   |   Mxxxxxxxx[CR]        | Sets Acceptance Code Register (ACn Register).
'm' |   YES   |   mxxxxxxxx[CR]        | Sets Acceptance Mask Register (AMn Register).
'U' |    -    |   Un[CR]               | Sets up UART with a new baud rate where n is 0-6.
'V' |   YES   |   V[CR]                | Gets software and hardware version characters.
'v' |   YES+  |   v[CR]                | Gets detailed version information.
'I' |   YES+  |   I[CR]                | Gets CAN FD controller information.
'i' |   YES+  |   i[CR]                | Gets detailed CAN FD controller information.
'N' |   YES   |   N[CR]                | Gets serial number of the hardware.
    |    +    |   Nxxxx[CR]            | Sets serial number of the hardware to xxxx,
    |         |                        | where the new serial number xxxx is a hex value.
'Z' |   YES   |   Zn[CR]               | Sets timestamp ON/OFF for received frames only.
    |         |                        | Z0 No timestamp
    |         |                        | Z1 Millisecond timestamp
    |    +    |                        | Z2 Microsecond timestamp
    |    +    |   Z[CR]                | Gets current timestamp
'z' |   YES+  |   znxyy[CR]            | Sets the reporting mechanism,
    |         |                        | where x and yy are hex values.
    |    -    |   z[CR]                | Gets detailed time
'Q' |   YES   |   Qn[CR]               | Sets auto startup feature ON/OFF (from power on). 
    |         |                        | Q0 Auto startup off
    |         |                        | Q1 Auto startup in normal mode
    |         |                        | Q2 Auto startup in listen only mode
----------------------------------------------------------------------------------------------------
```


# General rules

All commands to the device must be terminated with CR and they are CASE sensitive.

All response from the device is terminated with CR except BELL for ERROR.
The hexadecimal (hex) values are expressed with capital letters.


Special ascii codes
- CR (Ascii 13 / `'\r'`) : Used for OK or termination
- BELL (Ascii 7 / `'\a'`) : Used for ERROR


Data length code (DLC)
- `0-8`: Same as data length
- `9`: Length = 12
- `A`: Length = 16
- `B`: Length = 20
- `C`: Length = 24
- `D`: Length = 32
- `E`: Length = 48
- `F`: Length = 64



# Available ascii commands


## Sn[CR]

Setup CAN FD nominal bit rate, where `n` is 0-5.

- `S0`    10kbps
- `S1`    20kbps
- `S2`    50kbps
- `S3`    100kbps
- `S4`    125kbps
- `S5`    250kbps
- `S6`    500kbps
- `S7`    800kbps
- `S8`    1Mbps

Precondition:
- The CAN FD channel should be closed.

Example:
- `S4[CR]`

Sets up CAN FD nominal bit rate to 125kbps.

Return:
- CR for OK or BELL for ERROR.

Note:
- Though bit rate can be set with this command, it is recommended to use `s` and `y` commands for a proper bit timing.


## sddxxyyzz[CR]

Sets up CAN FD nominal bit-rates and bit-timing, where `dd`, `xx`, `yy` and `zz` are hex values.

- `dd`    Prescaler value in hex (01 - FF)
- `xx`    Time seg1 value in hex (01 - FF)
- `yy`    Time seg2 value in hex (01 - 80)
- `zz`    Sync jump width value in hex (01 - 80)

Precondition:
- The CAN FD channel should be closed.

Example:
- `s10460908[CR]`

Sets up CAN FD nominal bit rate to 125kbps and sampling point to 88.75%.
This is the default setting when the device is powered on.

See bit timing calculator in the "Useful Links" page for the relationship between these parameters and bit rate and bit timing.

Returns:
- CR for OK or BELL for ERROR.


## Yn[CR]

Sets up CAN FD data bit-rates, where `n` is 0-2, 4, 5, 8.

- `Y0`    500Kbps
- `Y1`    1Mbps
- `Y2`    2Mbps
- `Y4`    4Mbps
- `Y5`    5Mbps
- `Y8`    8Mbps

Precondition:
- The CAN FD channel should be closed.

Example:
- `Y2[CR]`

Sets up CAN FD data bit rate to 2Mbps.

Return:
- CR for OK or BELL for ERROR.

Note:
- Though bit rate can be set with this command, it is recommended to use `s` and `y` commands for a proper bit timing.


## yddxxyyzz[CR]

Sets up CAN FD data bit rate and bit timing, where `dd`, `xx`, `yy` and `zz` are hex values.

- `dd`    Prescaler value in hex (01 - 20)
- `xx`    Time seg1 value in hex (01 - 20)
- `yy`    Time seg2 value in hex (01 - 10)
- `zz`    Sync jump width value in hex (01 - 10)

Precondition:
- The CAN FD channel should be closed

Example:
- `y021E0908[CR]`

Sets up CAN FD data bit rate to 2Mbps and sampling point to 77.50%.
This is the default setting when the device is powered on.

See bit timing calculator in the "Useful Links" page for the relationship between these parameters and bit rate and bit timing.

Returns:
- CR for OK or BELL for ERROR.


## O[CR]

Opens the CAN FD channel in normal mode.

Precondition:
- The CAN FD channel should be closed.

Example:
- `O[CR]`

Opens the channel, TX LED is turned OFF.

Returns:
- CR for OK or BELL for ERROR.


## L[CR]

Opens the CAN FD channel in listen only mode.

Precondition:
- The CAN FD channel should be closed.

Example:
- `L[CR]`

Opens the channel, TX LED is turned OFF.

Returns:
- CR for OK or BELL for ERROR.


## C[CR]

Closes the CAN FD channel.

Precondition:
- The CAN FD channel should be open.

Example:
- `C[CR]`

Closes the channel, TX LED is turned ON.

Returns:
- CR for OK or BELL for ERROR.


## riiil[CR]

Transmits a base (11bit) remote frame.

- `iii`   Identifier in hex (000 - 7FF)
- `l`     Data length code in hex (0 - F)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example: 
- `r100F[CR]`

Sends a CAN remote frame with ID = 0x100 and DLC = F (64bytes).

Returns:
- `z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## Riiiiiiiil[CR]

Transmits a extended (29bit) remote frame.

- `iiiiiiii`   Identifier in hex (00000000 - 1FFFFFFF)
- `l`     Data length code in hex (0 - F)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example: 
- `R00000100F[CR]`

Sends a CAN remote frame with ID = 0x00000100 and DLC = F (64bytes).

Returns:
- `Z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## tiiildd...[CR]

Transmits a classical base (11bit) data frame.

- `iii`   Identifier in hex (000 - 7FF)
- `l`     Data length code in hex (0 - 8)
- `dd`    Data byte value in hex (00 - FF)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example:
- `t10020011[CR]`

Sends a classical CAN data frame with ID = 0x100 and 2 data bytes with the valued 0x00 and 0x11.

Returns:
- `z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## Tiiiiiiiildd...[CR]


Transmit a classical extended (29bit) data frame.

- `iiiiiiii`   Identifier in hex (00000000 - 1FFFFFFF)
- `l`          Data length code in hex (0 - 8)
- `dd`         Data byte value in hex (00 - FF)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example:
- `T0000010020011[CR]`

Sends a classic CAN data frame with ID = 0x00000100 and 2 data bytes with the values 0x00 and 0x11.

Returns:
- `Z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## diiildd...[CR]

Transmits a FD base (11bit) data frame without bit rate switch.

* `iii`   Identifier in hex (000 - 7FF)
* `l`     Data length code in hex (0 - F)
* `dd`    Data byte value in hex (00 - FF)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example:
- `d200900112233445566778899AABB[CR]`

Sends a CAN FD data frame with ID = 0x200 and 12 data bytes.

Returns:
- `z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## Diiiiiiiildd...[CR]

Transmits a FD extended (29bit) data frame without bit rate switch.

- `iiiiiiii`   Identifier in hex (00000000 - 1FFFFFFF)
- `l`          Data length code in hex (0 - F)
- `dd`         Data byte value in hex (00 - FF)

Precondition:
- The CAN FD channel should be open in normal mode.
- The CAN FD channel should not be bus off.
- The device has enough free buffer space to store the frame.

Example:
- `D00000200900112233445566778899AABB[CR]`

Sends a CAN FD data frame with ID = 0x00000200 and 12 data bytes.

Returns:
- `Z[CR]` (if tx event disabled) or `[CR]` (if enabled) for OK or BELL for ERROR.

See the "Reporting Mechanism" page for the details of the returned value.


## biiildd...[CR]

Transmits a FD base (11bit) data frame with bit rate switch.
This command is same as `d` except bit rate switch.


## Biiiiiiiildd...[CR]

Transmits a FD extended (29bit) data frame with bit rate switch.
This command is same as `D` except bit rate switch.


## F[CR]

Reads status flags.

Precondition:
- The CAN FD channel should be open.

Example:
- `F[CR]`

Reads status flags.

Returns:
- `Fxx[CR]` for OK or BELL for ERROR,
where `xx` is a hex value with 8 status bits:

0. Sets when CAN Tx or CDC Rx buffer overflows.
1. Sets when CAN Rx or CDC Tx buffer overflows.
2. Sets when a CAN error counter reaches warning level (96 or more).
3. Sets when a CAN frame is lost in the driver side.
4. Reserved
5. Sets when a CAN error counter reaches error passive level (128 or more).
6. Not supported
7. Sets when a CAN error counter increments.

All flags are cleared after responding to the `F` command.
They are also reset when the channel gets open by `O` command.
Any stored error flag will turn both green and blue LED to constant on.

For example, `FA4[CR]` is responded when the device has detected bus error and the error counter has exceeded error passive and warning level.
Or `F02[CR]` is returned when the device has been receiving too much CAN frames and some of them are lost before processed via USB.


## f[CR]

Reads detailed status.

Precondition:
- The CAN FD channel should be open.

Example:
- `f[CR]`

Reads detailed status.

Returns:
- `f: <Some thing>=<Some value>[CR]` style information(s) for OK or BELL for ERROR.


## Wn[CR]

Sets filter mode.
See the "Acceptance Filter" page for details.

- `W0`  Dual filter mode (not supported)
- `W1`  Single filter mode (not supported)
- `W2`  Simple filter mode (default)

Precondition:
- The CAN FD channel should be closed.

Example:
- `W2[CR]`

Sets filter mode to simple filter mode.

Returns:
- CR for OK or BELL for ERROR.


## Mxxxxxxxx[CR]

Sets Acceptance Code (ACn).
See the "Acceptance Filter" page for details.

- `xxxxxxxx`  Acceptance Code in hex with LSB first, AC0, AC1, AC2 & AC3.

Precondition:
- The CAN FD channel should be closed.

Example 1:
- `M00000000[CR]`

Sets Acceptance Code to 0x00000000.
This is default when power on.

Example 2:
- `M01234567[CR]`

Sets Acceptance Code to: AC0 = 0x01, AC1 = 0x23, AC2 = 0x45 & AC3 = 0x67.

Returns:
- CR for OK or BELL for ERROR.


## mxxxxxxxx[CR]

Sets Acceptance Mask (AMn).
See the "Acceptance Filter" page for details.

- `xxxxxxxx`  Acceptance Mask in hex with LSB first, AM0, AM1, AM2 & AM3.

Precondition:
- The CAN FD channel should be closed.

Example 1:
- `mFFFFFFFF[CR]`

Sets Acceptance Mask to 0xFFFFFFFF, which makes pass all filter i.e. all frames are received.
This is default when power on.

Example 2:
- `m89ABCDEF[CR]`

Sets Acceptance Mask to: AM0 = 0x89, AM1 = 0xAB, AM2 = 0xCD & AM3 = 0xEF.

Returns:
- CR for OK or BELL for ERROR.


## V[CR]

Gets version characters of both hardware and software

Precondition:
- None.

Example:
- `V[CR]`

Gets version characters.

Returns:
- `Vxxyy[CR]` for OK or BELL for ERROR,
where `xx` and `yy` are

- `xx`   Hardware version characters
- `yy`   Software version characters


## v[CR]

Gets detailed version information.

Precondition:
- None.

Example:
- `v[CR]`

Gets detailed version information.

Returns:
- `v: <Some thing>=<Some value>[CR]` style information(s) for OK or BELL for ERROR.


## I[CR]

Gets CAN controller information.

Precondition:
- None.

Example:
- `I[CR]`

Gets detailed CAN controller information.

Returns:
- `Ixyzz[CR]` for OK or BELL for ERROR,
where `x`, `y` and `zz` are

- `x`   CAN protocol (3 = ISO-CANFD)
- `y`   Reserved
- `zz`  CAN clock in hex (MHz)


## i[CR]

Gets detailed CAN controller information.

Precondition:
- None.

Example:
- `i[CR]`

Gets detailed CAN controller information.

Returns:
- `i: <Some thing>=<Some value>[CR]` style information(s) for OK or BELL for ERROR.


## N[CR]

Gets serial number of the device.

Precondition:
- None.

Example:
- `N[CR]`

Gets serial number.

Returns:
- `Nxxxx[CR]` for OK (ex. `NA123[CR]`) or BELL for ERROR.


## Nxxxx[CR]

Sets serial number of the device.
Digits 1-9 and letters A-F can be used for serial number.

- `xxxx`    The serial number in hex (0000 - FFFF)

Precondition:
- None.

Example:
- `NA123[CR]`

Sets serial number to `A123`.

Returns:
- CR for OK or BELL for ERROR.


## Z[CR]

Gets current timestamp.

Precondition:
- Timestamp should be enabled.

Example:
- `Z[CR]`

Gets timestamp.

Returns:
- `Zxxxx[CR]` (ms) or `Zxxxxxxxx[CR]` (us) for OK or BELL for ERROR.


## Zn[CR]

Sets timestamp on/off for received frames only.

Unlike CAN232 or CANUSB, this command itself does not write non-volatile memory.
The timestamp mode is stored in non-volatile memory when auto startup feature is enabled by `Q` command.

- `Z0`  Timestamp off
- `Z1`  Milli second timestamp (2 bytes in hex, reset to 0 at 0xEA60 ms = 60,000 ms)
- `Z2`  Micro second timestamp (4 bytes in hex, reset to 0 at 0xD693A400 us = 3600,000,000 us)

Precondition:
- The CAN FD channel should be closed.

Example 1:
- `Z0[CR]`

Turns off the timestamp feature (default).

Example 2:
- `Z2[CR]`

Turns on the micro second timestamp feature.
Four bytes timestamp is attached behind data bytes of the frame.

Returns:
- CR for OK or BELL for ERROR.


## z[CR]

Gets detailed time.

Precondition:
- None.

Example:
- `z[CR]`

Gets detailed time.

Returns:
- `z: <Some thing>=<Some value>[CR]` style information(s) for OK or BELL for ERROR.


## znxyy[CR]

Sets up the reporting mechanism.

- `n`   Timestamp mode corresponding to `Z` command
- `x`   Reserved
- `yy`  A hex value with 8 bits:

0. Enables (1) or disables (0) Rx frame report.
1. Enables (1) or disables (0) Tx event report.
2. Reserved
3. Reserved
4. Enables (1) or disables (0) ESI (Error Status Indicator) in Rx frame and Tx event report.
5. Reserved
6. Reserved
7. Reserved

Precondition:
- The CANFD channel should be closed.

Example 1:
- `z0001[CR]`

Turns on Rx frame reporting without timestamp or ESI (default).

Example 2:
- `z1012[CR]`

Turns on Tx event with milli second timestamp and ESI.
The ESI bit is placed behind timestamp and `0` is used for error active and `1` for error passive.
No Rx frame is reported in this setting.

Returns:
- CR for OK or BELL for ERROR.

Note:
- The milli second timestamp is taken after the CAN frame transmission is complete, 
  while the micro second timestamp is taken at the start of CAN frame.
- This command is mutually exclusive with the `Z` command.
  Any settings made by this command will be overwritten by the one in the command or by default.


## Q[CR]

Sets up auto startup feature.

- `Q0`  Auto startup off
- `Q1`  Auto startup on (Normal mode)
- `Q2`  Auto startup on (Listen only mode)

Precondition:
- The CANFD channel should be open.

Example 1:
- `Q0[CR]`

Turns off the auto startup feature (default).
On next power up, the device works normally waiting for commands for setup etc.

Example 2:
- `Q1[CR]`

Turns on the auto startup feature in normal mode.
On next power up, the device automatically opens the channel in normal.

Returns:
- CR for OK or BELL for ERROR.

Note:
- Settings for bit-rates (`S`, `s`, `Y` and `y`), filter (`W`, `M` and `m`) and report (`Z` and `z`) is stored in non-volatile memory and automatically applied on every power on.
